from docx import Document

# เปิดไฟล์ docx
doc = Document('บันทึกตรวจยึด.docx')

# พจนานุกรมเก็บคำที่ต้องการเปลี่ยน: {"คำเก่า": "คำใหม่"}
replacements = {
    "๑๐": "๑",
    "กุมภาพันธ์": "มกราคม",
    "15.00 น.": "14.00 น.",
    "11:40 น.": "12.00 น.",
    "ณัฏฐพัชร์": "นราวิช",
    "งามประดิษฐ์": "ธีรนันท์",
    "สุทธิรักษ์": "ธนากร",
    "แก่นจันดา": "พิทัก",
    "จีระพันธ์": "วรวิทย์",
    "คำมุข": "ศิริพง",
    "ณัฏฐ์เดช": "ณัฏพล",
    "นามแก้ว": "วิทยา",
    "เดชา": "ปรัชญา",
    "ดีผาย": "สงวนเกียรติ",
    "ถิรายุทธ์": "ภูมิสิทธิ์",
    "เขตรักษา": "ชัยมงคล",
    "กิตติศักดิ์": "พชร",
    "ศรีชัย": "ศรีเจริญ",
    "๘๘๓/๒๕๖๘": "๘/๒๕๖๘",
    "๑๐ ก.พ.๖๘": "๑ ม.ค. ๖๒",
    "1-๑๐๐๕-๐๐๓๕๖-39-๑": "1-1110-06421-55-7",
    "หมู่ ๒๕/๑": "หมู่ ๑/๑",
    "1๑.๔๐ น.": "12.00 น.",
    "1๓.๐๐": "13.00 น.",
    "ธีรวัฒน์ ": "นริณ ",
    "จานแบน": "กำแพงแสน",
    "ธฤต": "ธนัท",
    "ภู่ประดิษฐ์": "ประดิษ",
    "ราชวินิต มัธยม": "ราวิต",
    "สีแยกมหานาค": "จตุจักร",
    
    
    

    # เพิ่มข้อมูลที่ต้องการเปลี่ยนได้ที่นี่
}

# ลูปผ่านแต่ละพารากราฟและแก้ไขเนื้อหาที่มีคำเก่า
for para in doc.paragraphs:
    for run in para.runs:
        for old_name, new_name in replacements.items():
            if old_name in run.text:
                run.text = run.text.replace(old_name, new_name)

# ลูปผ่านแต่ละเซลล์ในตารางเพื่อแก้ไขเนื้อหาที่มีคำเก่า
for table in doc.tables:
    for row in table.rows:
        for cell in row.cells:
            for para in cell.paragraphs:
                for run in para.runs:
                    for old_name, new_name in replacements.items():
                        if old_name in run.text:
                            run.text = run.text.replace(old_name, new_name)

# บันทึกไฟล์ใหม่
doc.save('outputบันทึกตรวจยึด.docx')

print("เปลี่ยนหลายข้อมูลในเอกสารเสร็จเรียบร้อยแล้ว!")
