from docx import Document

# เปิดไฟล์ docx
doc = Document('มาตรา 22.docx')

# พจนานุกรมเก็บคำที่ต้องการเปลี่ยน: {"คำเก่า": "คำใหม่"}
replacements = {
    "ธีรวัฒน์": "นริณ",
    "จานแบน": "กำแพงแสน",
    "จารแบน": "กำแพงแสน",
    "ธีรวัฒน์ฯ": "นริณฯ",
    "ปิ่นวรางค์": "วรารัตน์",
    "กลิ่นหวล": "งามเลิศ",
    "ทักษิณาบริหารธุรกิจ": "บริหาร",
    "วิภาวรรณ": "สุดา",
    "พุฒนอก": "คำแสง",
    "วรวุฒิ": "สุชาติ",
    "วรวุฒิฯ ": "สุชาติฯ",
    "ตูน": "ต้า",
    "ทักษิณาบริหารธุรกิจ": "บริหาร",
    "ก้องปพัฒน์": "ก้องภพ",
    "ขันเงินธัญวัฒน์": "วรากร",
    "ณัฏฐพัชร์": "นราวิช",
    "งามประดิษฐ์": "กำธีรนันท์",
    "๐89-3559965": "0826789054",
    "ณัฏฐ์เดช": "ณัฏพล",
    "นามแก้ว": "วิทยา",
    "สมนึก": "อัครพล",
    "อินเหว่าวงศ์": "อินทรสวัสดิ์",
    "0879726624": "0836728903",
    "1-๑๐๐๕-๐๐๓๕๖-39-๑": "๑-๑๑๑๐-๐๖๔๒๑-๕๕-๗",
    "๒๕/๑": "๑/๑",
    
    
    

    # เพิ่มข้อมูลที่ต้องการเปลี่ยนได้ที่นี่
}

# ลูปผ่านแต่ละพารากราฟและแก้ไขเนื้อหาที่มีคำเก่า
for para in doc.paragraphs:
    for run in para.runs:
        for old_name, new_name in replacements.items():
            if old_name in run.text:
                run.text = run.text.replace(old_name, new_name)

# ลูปผ่านแต่ละเซลล์ในตารางเพื่อแก้ไขเนื้อหาที่มีคำเก่า
for table in doc.tables:
    for row in table.rows:
        for cell in row.cells:
            for para in cell.paragraphs:
                for run in para.runs:
                    for old_name, new_name in replacements.items():
                        if old_name in run.text:
                            run.text = run.text.replace(old_name, new_name)

# บันทึกไฟล์ใหม่
doc.save('outputมาตรา 22.docx')

print("เปลี่ยนหลายข้อมูลในเอกสารเสร็จเรียบร้อยแล้ว!")
